import { FeedWrapper } from "@/components/feed-wrapper"
import { StickyWrapper } from "@/components/sticky-wrapper"
import { UserProgress } from "@/components/user-progress"
// import { Header } from "@/components/header"
import { TabCars } from "@/components/tab-cars"
import { Siren } from "lucide-react"
// import { getCarsData } from "@/app/_lib/readSheet"
import { getCars, getWorks } from "@/db/queries"
import { getCarsData } from "@/app/_lib/readSheet"
import { HeaderWGarageU } from "@/components/header-with-garage-update"
import { updateGarageOdometer } from "@/actions/update-garage-odometer"
// import { TgSendMsgCom } from "@/components/tg-send-message-com"


 const CarsPage = async () => {

    const googleCars = await getCarsData()

    // Получаем Одометры Из Гугла
    // Аплоадим их в Cars
    // Грузим данные из Cars

    // чтобы синхронизовать отдельная кнопка "обновить ОДОМЕТРЫ" которая только revalidate





    if (!googleCars) {
        throw new Error('Нет машин из Google!');
    }


    const googleCarsObject = googleCars.map(el => {
        return (
            {
                id: +el[0],
                carNum: el[1],
                driver: el[2],
                odometer: el[4].replace(/\s/g, ''),
            }
        )
    })


    if (googleCarsObject.length > 0) {
        await updateGarageOdometer(googleCarsObject)
    }






    const dbCarsData = await getCars()
    const dbWorksData = await getWorks()

	const [
		dbCars,
		dbWorks,
	] = await Promise.all([
		dbCarsData,
		dbWorksData,		
	]);

   

    if (!dbCars) {
        throw new Error('Нет машин!');
    }


   

    const carsObject = dbCars.map(el => {
        return (
            {
                id: el.id,
                carNum: el.carNum,
                driver: el.driver,
                type: el.type,
                odometer: el.odometer.replace(/\s/g, ''),
                to_prev: el.TOprev,
                // to_next: el.TOnext,
                next_to: dbWorks.filter(work => work.carId == el.id)[0]?.nextTO || "0",
                model: el.model,
            }
        )
    })


    // СОРТИРУЕМ ПО РАЗНИЦЕ      ПРОБЕГ - СЛЕД ТО
    //
    carsObject.sort((a,b) => (Math.abs(+a.next_to - +a.odometer) > Math.abs(+b.next_to - +b.odometer)) 
    ? 1 
    : ((Math.abs(+b.next_to - +b.odometer) > Math.abs(+a.next_to - +a.odometer)) ? -1 : 0))


    



    // СОРТИРОВКА ПО АЛФАВИТУ гос НОМЕРА
    //
    // carsObject.sort(function(a, b) {
    //     const textA = a.carNum.toUpperCase();
    //     const textB = b.carNum.toUpperCase();
    //     return (textA < textB) ? -1 : (textA > textB) ? 1 : 0;
    // });

    const all = carsObject.filter(el => el.odometer != '0')
    
    const mixers = carsObject.filter(el => el.type.toUpperCase()== 'М' && el.odometer != '0')
    const tonars = carsObject.filter(el => el.type.toUpperCase() == 'Т' && el.odometer != '0')
    const samosv = carsObject.filter(el => el.type.toUpperCase() == 'С' && el.odometer != '0')
    const errCars = carsObject.filter(el => el.odometer == '0')


    const FourTypes = [all, samosv, tonars, mixers, errCars]

    // console.log(mixers)


    const NumCarsZeroOdometer = carsObject.filter(el => el.odometer == "0").length

    // console.log(NumCarsZeroOdometer)


    const message = `🚨 ${errCars.length} машин с пробегом 0 км`
    console.log(message)


    return(
        <div className="flex flex-row-reverse gap-[48px] px-6">
        {/* <div className="flex flex-row-reverse gap-[48px] pl-10"> */}
            <StickyWrapper>
                <UserProgress />
            </StickyWrapper>

            <FeedWrapper>



                {/* <TgSendMsgCom message={message} /> */}



                <HeaderWGarageU title='Автопарк'/>

                {NumCarsZeroOdometer > 0 && 

                    <div className="flex mt-10 gap-2 border-2 border-yellow-400 border-dashed justify-center p-4 w-full rounded-xl">
                        <Siren  className='h-6 w-6 text-red-500'/>
                        <p className="pt-1">
                            {NumCarsZeroOdometer} авто с пробегом 0 км
                        </p>
                    </div>
                }
            

                <div className="mt-5 mb-5">
                    <TabCars FourTypes={FourTypes} dbWorks={dbWorks}/>
                </div>


            </FeedWrapper>
        </div>
    )
 }

 export default CarsPage













  // const cars = [

    //     [ '1', 'а546мк750', 'Автаев Аюб Дзамирович', 'Т', '489 492' ],
    //     [ '2', 'с603хк190', '', 'Т', '332242' ],
    //     [ '3', 'о009ух190', '', 'С', '0' ],
    //     [ '4', 'а534нн', '', 'Т', '0' ],
    //     [ '5', 'е602ст', '', 'С', '0' ],
    //     [ '6', 'с285вн790', '', 'М', '0' ],
    //     [ '7', 'м473ау790', '', 'С', '24568' ],
    //     [ '8', 'м549ау790', '', 'М', '49349' ],
    //     [ '9', 'е654ас790', '', 'Т', '47422' ],
    //     [ '10', 'м609ау790', '', 'С', '0' ],
    //     [ '11', 'у003вк790', '', 'Т', '55868' ],
    //     [ '12', 'м608ау790', 'Коцоев Марат Витальевич', 'С', '185 138' ],
    //     [ '13', 'х521ау790', '', 'М', '0' ],
    //     [ '14', 'м467ау790', '', 'М', '0' ],
    //     [ '15', 'м561ау790', '', 'С', '0' ],
    //     [ '16', 'м584ау790', '', 'Т', '0' ],
    //     [ '17', 'т750вм790', '', 'М', '0' ],
    //     [ '18', 'т724вм790', '', 'М', '40119' ],
    //     [ '19', 'м655ау790', '', 'Т', '34431' ],
    //     [ '20', 'с278вн790', '', 'Т', '0' ],
    //     [ '21', 'м507ау790', 'Елесов Рустам Рамзанович', 'М', '201 177' ],
    //     [ '22', 'с253вн790', '', 'М', '0' ],
    //     [ '23', 'м612ау790', 'Назаров Ш.Н.', 'С', '0' ],
    //     [ '24', 'с204вн790', '', 'С', '0' ],
    //     [ '25', 'м412ау790', '', 'С', '0' ],
    //     [ '26', 'с301вн790', 'Хушпаров Усман Виситович', 'М', '218 994' ],
    //     [ '27', 'м515ау790', '', 'М', '0' ],
    //     [ '28', 'с264вн790', '', 'М', '0' ],
    //     [ '29', 'м644ау790', '', 'С', '0' ],
    //     [ '30', 'с306вн790', 'Майрабеков Алхазур Лечиевич', 'С', '181 444' ],
    //     [ '31', 'м600ау790', '', 'С', '0' ],
    //     [ '32', 'с308вн790', '', 'С', '0' ],
    //     [ '33', 'м606ау790', '', 'С', '0' ],
    //     [
    //         '34',
    //         'с238вн790',
    //         'Карибов Физиули Насраддин Оглы',
    //         'С',
    //         '204 417'
    //     ],
    //     [ '35', 'с296вн790', '', 'М', '0' ],
    //     [ '36', 'м509ау790', '', 'С', '32066' ],
    //     [ '37', 'м538ау790', '', 'С', '0' ],
    //     [ '38', 'м615ау790', 'Хушпаров Апти Сулейманович', 'М', '209 330' ],
    //     [ '39', 'м592ау790', '', 'С', '0' ],
    //     [ '40', 'м558ау790', '', 'С', '0' ],
    //     [ '41', 'в896ра750', '', 'М', '0' ],
    //     [ '42', 'а544мк750', '', 'М', '0' ],
    //     [ '43', 'м591ау790', '', 'Н', '0' ],
    //     [ '44', 'у573ку750', '', 'С', '348817' ],
    //     [ '45', 'а540мк750', '', 'Т', '0' ],
    //     [ '46', 'к423хм190', '', 'С', '0' ],
    //     [ '47', 'а426ае750', '', 'С', '504643' ],
    //     [ '48', 'е687ас790', '', 'С', '46391' ],
    //     [ '49', 'м454ау790', '', 'С', '0' ],
    //     [ '50', 'к893уо190', '', 'С', '0' ],
    //     [ '51', 'т782вм790', '', 'М', '34443' ],
    //     [ '52', 'е438ас790', '', 'С', '35448' ],
    //     [ '53', 'а562мк750', '', 'Т', '0' ],
    //     [ '54', 'а545мк750', 'Керимов Альви Исаевич', 'М', '457 492' ],
    //     [ '55', 'к889уо190', '', 'Т', '0' ],
    //     [ '56', 'р279ке750', '', 'С', '263599' ],
    //     [ '57', 'р280ке750', '', 'М', '305362' ],
    //     [ '58', 'р281ке750', '', 'С', '193143' ],
    //     [ '59', 'р284ке750', '', 'С', '309326' ],
    //     [ '60', 'х169ео790', '', 'С', '0' ],
    //     [ '61', 'р283ке750', '', 'С', '320547' ],
    //     [ '62', 'н026ха790', '', 'С', '0' ],
    //     [ '63', 'а559мк750', 'Теминов Марат Рашидович', 'Т', '475 645' ],
    //     [ '64', 'с172хн790', 'Чупилов Андрей Юрьевич', 'С', '123 078' ],
    //     [
    //         '65',
    //         'н445хк790',
    //         'Машукаев Саламбек Зелимханович',
    //         'М',
    //         '112 310'
    //     ],
    //     [ '66', 'н419хк790', '', 'С', '0' ],
    //     [ '67', 'н439хк790', 'Зорин Алексей Сергеевич', 'М', '134 260' ],
    //     [ '68', 'н456хк790', 'Мальцагов Руслан Вахаевич', 'М', '102 127' ],
    //     [ '69', 'в751вс790', 'Чубкин Александр Алексеевич', 'С', '244 510' ],
    //     [ '70', 'х520ау790', 'Фаградян Манвел Варичович', 'М', '366 726' ],
    //     [
    //         '71',
    //         'в864вс790',
    //         'Магомадов Темирлан Блавдяевич',
    //         'С',
    //         '256 828'
    //     ],
    //     [ '72', 'м410вт790', 'Милашенко Владимир Иванович', 'Т', '413 568' ],
    //     [
    //         '73',
    //         'в736вс790',
    //         'Магамедхаджиев Рашид Рамазанович',
    //         'М',
    //         '297 285'
    //     ],
    //     [ '74', 'т002ах790', '', 'С', '0' ],
    //     [ '75', 'в717вс790', '', 'М', '0' ],
    //     [ '76', 'м411вт790', 'Петиров Имран Муталипович', 'М', '419 049' ],
    //     [ '77', 'х580ау790', 'Дахаев Абу Саидмухаметович', 'М', '275 689' ],
    //     [ '78', 'е353кт790', 'Узбеков Равиль Фаритович', 'С', '319 048' ],
    //     [ '79', 'в793вс790', 'Алехин Николай Александрович', 'М', '318 483' ],
    //     [ '80', 'м427вт790', 'Бязров Арсен Назирович', 'Т', '285 193' ],
    //     [ '81', 'в818вс790', 'Шахмурзаев Саид Салманович', 'С', '366 090' ],
    //     [ '82', 'в747вс790', 'Махмудов Абу Мухмадович', 'С', '249 923' ],
    //     [ '83', 'м448вт790', 'Баймурзаев Анзор Муратович', 'С', '273 534' ],
    //     [ '84', 'х500ау790', '', 'Т', '0' ],
    //     [ '85', 'м414вт790', 'Арсакаев Асламбек Шуддинович', 'Т', '355 200' ],
    //     [
    //         '86',
    //         'х517ау790',
    //         'Мухтаров Ахмед Селимсолтаевич',
    //         'С',
    //         '256 088'
    //     ],
    //     [ '87', 'м335вт790', 'Ибрагимов Умар Байалиевич', 'Т', '470 284' ],
    //     [ '88', 'в821вс790', 'Ахмадов Шайхмагомед Музаевич', 'С', '221 794' ],
    //     [ '89', 'в865вс790', '', 'М', '0' ],
    //     [ '90', 'в727вс790', '', 'С', '0' ],
    //     [ '91', 'с054хм790', '', 'М', '0' ],
    //     [ '92', 'м419вт790', '', 'Т', '0' ],
    //     [ '93', 'е274хх790', 'Эхаев Апти Виситович', 'С', '128 976' ],
    //     [ '94', 'к118ру790', '', 'Т', '0' ],
    //     [ '95', 'у273тн790', '', 'С', '0' ],
    //     [ '96', 'в160тн790', '', 'М', '0' ],
    //     [ '97', 'х831вр790', '', 'М', '0' ],
    //     [ '98', 'м233хк790', '', 'С', '0' ],
    //     [ '99', 'у267тн790', 'Бибулатов Расул Геланиевич', 'Т', '149 293' ],
    //     [ '100', 'х781вр790', '', 'М', '0' ]

    // ]
